---
kind: property
id: P:Autodesk.Revit.DB.Events.ViewPrintingEventArgs.Index
source: html/2dec1696-bbde-7d98-9335-8209a203a1f9.htm
---
# Autodesk.Revit.DB.Events.ViewPrintingEventArgs.Index Property

The index of the view being printed out of the set of all views being printed.

## Syntax (C#)
```csharp
public int Index { get; }
```

## Remarks
The index is zero-based. When a single view is being printed, this value should be 0.